{
  "vocab_size": 151936,
  "hidden_size": 1024,
  "num_layers": 28,
  "num_attention_heads": 16,
  "num_key_value_heads": 8,
  "intermediate_size": 2816,
  "max_position_embeddings": 32768,
  "rms_norm_eps": 1e-6,
  "rope_theta": 1000000.0,
  "use_sliding_window": false,
  "sliding_window": null,
  "model_type": "qwen3",
  "architectures": ["Qwen3ForCausalLM"]
}